[	
	":compton: : “Life is hard, you get through that. NP-complete is hard, you can get through that as well.”",
	":compton: : “This is the secret about CS majors. The faculty knows we can give you guys a ridiculous amount of work and you’ll do it.”",
	":compton: [about ==] : “Well if you really mean equal you have to say it twice.”",
	":compton: : “You know you’re in a proof because all of a sudden you don’t understand anything you just read.”",
	":compton: : “The book doesn't want to scare you, so it doesn't throw around words like 'theorem' and 'proof'.”",
	":compton: : “Some people like pseudocode, some people hate pseudocode”",
	":compton: : “Let's do something easy. Let's talk about dynamic programming”",
	":compton: : “You guys paid tuition money, I don't want to cheat you...”",
	":schoenebeck: : _literally nothing interesting_",
	":compton: : “This is why we have tortured you for the last two class periods. Well, not two class periods because I still have 10 minutes left.”",
	":compton: : “If you’re going to discover something, be the last to discover it. No one ever remembers the first person.”",
	":compton: : “Some mathematicians say that the natural numbers start at 1. They're wrong.”",
	":compton: : “Zero is the most natural number”",
	":compton: : “'Trivial' means 'I don't want to verify the details.' It doesn't work on an exam.”",
	":compton: : “It doesn't seem like it makes sense, but it makes sense”",
	":compton: : “Is discussion helpful?” literally everyone: “no”",
	":schoenebeck: : “Multi-source/multi-sink flow problem”",
	":compton: : “Who knew [counting the number of serifs] would lead to greatness?”",
	":compton: : “Plato believes we are born knowing everything. But I guess the trauma of being born makes us forget it all, so we have to relearn it.”",
	":compton: : “You guys look proof weary.”",
	":compton: : “We’ll play department of defense. We have an infinite budget.”",
	":compton: : “Does anyone here speak Hungarian? No? Good. I really know nothing about Hungarian phonology.” ",
	":compton: : _does the exact same lecture again_ ",
	":compton: : “Once a man has been engaged, it can only go downhill from there” ",
	":compton: : “It's the golden rule. He who has the gold makes the rule.”",
	":compton: : “We don't count goats that way today. We have scanners.”",
	":compton: : “There are THREE parts. Three parts.”",
	":compton: : “If you want to make a million dollars, don’t try to research NP. Go into real estate or something.”",
	":compton: : “He had a loud, booming voice, like an old-testament prophet.”",
	":compton: : _gesticulating excitedly_ “Everything is strings!”",
	"student : “Are you allowed to just prove by example like that?”\n:compton: : “Well, _I_ am.”\n:compton: : “Depends on how many points you want.”",
	":compton: : “If you solve this problem, you get a million dollars AND you don't have to take the final.”",
	":compton: : “He cut quite the figure in Waterloo. He was nothing special in Berkeley, but he was a weirdo in Waterloo.”", 
	":compton: : “These are all solvable! You may not be able to solve it in the lifetime of the universe, but you can solve it.”",
	":compton: : “As you get older, you tend to get less strict.”",
	":compton: : “IAs, you're tough, right?”\n:moos: : “Yeah, we are.”",
	":compton: : “You can't tell faculty to do anything. You can't tell anyone to do anything, but especially faculty.”",
	":compton: : “Here's a primitive root, and a tax break on top of that.”",
	":compton: : “Everyone's looking at me like I'm crazy.”",
	":compton: : “If you just write this, you'll already get two points. At least if a professor grades it. If a GSI grades it, it'll get you a point. If an IA grades it, you're sunk. They're tough.”",
	":compton: : “The algorithm we gave you for Max Flow isn't really polynomial, but you can make it polynomial by being clever and making it polynomial.”",
	":compton: : _calling the graders strict_ “There are other words that some people use to describe the graders... Strict is good though.”",
	":compton: : “The grader will say ‘well, this is not what I intended to hear, so I will give you 4/16 points.’ And that's pretty arbitrary, but if it’s arbitrary for everyone, that's arbitrary justice.”",
	":compton: : “Red is true! It sounds profound if a poet says it, but for us it's just arbitrary.”",
	":compton: : “If you go to your boss and say that [NP-completeness] is the end of the story, they'll say that's the end of you.”",
	":compton: : “He said if you can 4-color this, I’ll buy you a case of beer. So I did. It was the hardest I ever worked for a case of beer.”"
]
