[
	"Moose are the largest of all the deer species.",
	"Male moose are immediately recognizable by their huge antlers, which can spread 6 feet (1.8 meters) from end to end.",
	"Moose have long faces and muzzles that dangle over their chins. A flap of skin known as a bell sways beneath each moose's throat.",
	"Moose are so tall that they prefer to browse higher grasses and shrubs because lowering their heads to ground level can be difficult.",
	"Males, called bulls, bellow loudly to attract mates each September and October. The usually solitary bulls may come together at this time to battle with their antlers for mating supremacy.",
	"After mating, the two moose go their separate ways until the following year. Though they may occasionally feed in the same grounds, they tend to ignore each other.",
	"Female moose give birth to one or two calves in the spring - each weighing some 30 pounds (14 kilograms). These calves grow quickly and can outrun a person by the time they are just five days old.",
	"In winter, moose eat shrubs and pinecones, but they also scrape snow with their large hooves to clear areas for browsing on mosses and lichens.",
	"Moose's hooves act as snowshoes to support the heavy animals in soft snow and in muddy or marshy ground.",
	"In the summer, when the ice melts, moose are often seen in lakes, rivers, or wetlands, feeding on aquatic plants both at and below the surface.",
	"Moose are at home in the water and, despite their staggering bulk, are good swimmers. They have been seen paddling several miles at a time, and will even submerge completely, staying under for 30 seconds or more.",
	"The plural of moose is moose.",
	"Moose are nimble on land. They can run up to 35 miles (56 kilometers) an hour over short distances, and trot steadily at 20 miles (32 kilometers) an hour.",
	"The average lifespan of a moose in the wild is 15 to 20 years.",
	"Male moose (or 'bulls') normally weigh from 380 to 700 kg (838 to 1,543 lb) and females (or 'cows') typically weigh 200 to 490 kg (441 to 1,080 lb)",
	"A group of moose is called a herd.",
	"Moose are herbivores, meaning they smoke a lot of weed.",
	"The moose is the state animal of Maine.",
	"Currently, most moose are found in Canada, Alaska, New England, Fennoscandia, Latvia, Estonia and Russia.",
	"The most common moose predators are the gray wolf along with bears and humans.",
	"Unlike most other deer species, moose are solitary animals and do not form herds. The strongest bond in moose is often between mother and calf.",
	"Although generally slow-moving and sedentary, moose can become aggressive and move quickly if angered or startled.",
	"The Latin species name for moose is 'Alces alces'. Alces alces is called a 'moose' in North American English, but an 'elk' in British English. That same word 'elk' in North American English refers to a completely different species of deer, the Cervus canadensis, also called the wapiti.",
	"A mature male moose is called a bull, a mature female a cow, and an immature moose of either sex a calf.",
	"The word 'moose' comes from 'moos', a word in the ancient Algonquin language of Narragansett, which is likely derived from 'moosu', which means 'he strips off.'",
	"After expanding for most of the 20th century, the moose population of North America has been in steep decline since the 1990s. Populations expanded greatly with improved habitat and protection, but for unknown reasons, the moose population is declining rapidly.",
	"The Native Americans often used moose hides for leather and its meat as an ingredient in pemmican, a type of dried jerky used as a source of sustenance in winter or on long journeys. Eastern tribes also valued moose leather as a source for moccasins and other decorations.",
	"In the Midwest U.S., moose are primarily limited to the upper Great Lakes region, but strays, primarily immature males, have been found as far south as eastern Iowa. For unknown reasons, the moose population is declining rapidly in the Midwest.",
	"The largest subspecies of moose is the Alaska Moose. Male Alaska moose can stand over 2.1 m (6.9 ft) at the shoulder, and weigh over 1,400 lb (635 kg). The antlers on average have a span of 1.8 m (5.9 ft).",
	"The average adult moose needs to consume 9,770 kcal (40.9 MJ) per day to maintain its body weight.",
	"Moose often rely on aquatic plants to satisfy their daily sodium intake. In winter, moose are often drawn to roadways, to lick salt that is used as a snow and ice melter.",
	"Moose lack upper front teeth, but have eight sharp incisors on the lower jaw. They also have a tough tongue, lips and gums, which aid in the eating of woody vegetation.",
	"Moose cannot digest hay, and feeding it to a moose can be fatal.",
	"Female moose select mates based on antler size. In the animal kingdom, size does matter.",
	"Just like a dog's wet nose, the symmetry of a moose's antlers reflects their health.",
	"After the mating season males drop their antlers to conserve energy for the winter. A new set of antlers will then regrow in the spring.",
	"Antlers take three to five months to fully develop, making them one of the fastest growing animal organs.",
	"Behind only the two species of bison, the moose is the second largest land animal in both North America and Europe.",
	"Just like humans, moose have \"personal space.\" If you violate a moose's personal space, they may become aggressive and charge.",
	"Moose meat tastes, wrote Henry David Thoreau in \"The Maine Woods\", \"like tender beef, with perhaps more flavour; sometimes like veal.\"",
	
]