[
    "Moos is a Junior in CSE at the University of Michigan.",
    "Moos' name is actually pronounced 'NAY-then MOAZ'.",
    "Moos has two parents: one mother and one father.",
    "Moos identifies as a human male, but experts disagree as to whether or not he is a robot.",
    "Moos works as an IA for EECS 281. This will be his second semester doing so.",
    "Moos is in charge of maintaining the EECS 281 Autograder.",
    "In 2014, Moos graduated from Skyline High School in Salt Lake City, Utah.",
    "In 2011, Moos graduated from Churchill Junior High School in Salt Lake City, Utah.",
    "Moos attended Granite Technical Institute in Salt Lake City, Utah for 1 year between junior high and middle school.",
    "Moos was programmer for FIRST Robotics team #3334. He also holds the esteemed title of 'Candy Thrower'.",
    "Moos' GitHub username is 'moosingin3space'. His profile currently has 52 repositories, 18 of which are forks.",
    "Although Moos is from Salt Lake City, Utah, his hometown is actually Kalamazoo, Michigan.",
    "Moos was born on May 3, 1996.",
    
    "Moos worked as 'Engineering Intern' at ExtraHop Networks during Summer 2016.",
    "Moos worked as 'Data Analyst' at Computer Aided Engineering Network during the 2015 and 2016 academic year.",
    "Moos worked as 'Backend Engineer' at Stratos during Spring/Summer 2015.",
    "Moos worked as 'Junior Instructor' at 'Denda Academy of Martial Arts' from 2012-2014.",
    
    "According to his Facebook page, Moos speaks 'English' and 'American English'.",
    "According to his Facebook page, Moos identifies as a 'Progressive Liberal'.",
    "Two Steps from Hell is one of Moos' favorite musical artists.",
    "Moos really likes the bands Boston and The Who.",
    "Moos is a fan of the band Van Halen.",
    "Moos likes to listen to the band Dire Straits.",
    "Moos enjoys Star Trek and its related movies and series.",
    "Moos is obsessed with Rust, just like everybody who has ever coded in Rust.",
    "Moos ordered a Chipotle Chicken sandwich from Panera on February 1, 2017. With a side of tomato soup.",

    "Moos knows C++, C, Java, Python, JavaScript, SQL, Go, and Rust.",

    "Moos once took a two-week luxury cruise to Lithuania while simultaneously fighting off a gaggle of geese.",
    "Moos, contrary to popular belief, is not a moose. He identifies as a human being.",
    "Moos was once a prominent figurehead in the United Soviet Socialist Republics.",
    "Moos was once charged with high treason against the USA for exposing classified government information.",
    "Moos is widely known for being an EECS 281 IA, but few people know that he is actually the distant cousin of Alan Turing.",

    "Moos enjoys reading the famed nerd comic XKCD.",
    "Moos is Turing-complete.",
    "Moos",

    "Moos' uniqname is 'moosnat', which is a derivative of the ancient Greek word 'meoskonat', meaning \"That's not how you pronounce my name.\"",
    "Moos exclusively uses the 24-hour clock to refer to times of day, and has done this since 7th grade.",
    "Despite his Utahn lineage, Moos is not Mormon. He does however, have many Mormon friends.",
    "Moos is part of the MRover design team.",
    "The plural form of Moos is Moosen."
]